feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Boot/Libraries/Infra/Sfr/TC27D/_Reg/IfxEray_regdef.h
/** \brief  Access Enable Register 1 */
typedef struct _Ifx_ERAY_ACCEN1_Bits
{
    unsigned int reserved_0:32;             /**< \brief \internal Reserved */
} Ifx_ERAY_ACCEN1_Bits;

/** \brief  Aggregated Channel Status */
typedef struct _Ifx_ERAY_ACS_Bits
{
    unsigned int VFRA:1;                    /**< \brief [0:0] Valid Frame Received on Channel A (vSS!ValidFrameA) (rwh) */
    unsigned int SEDA:1;                    /**< \brief [1:1] Syntax Error Detected on Channel A (vSS!SyntaxErrorA) (rwh) */
    unsigned int CEDA:1;                    /**< \brief [2:2] Content Error Detected on Channel A (vSS!ContentErrorA) (rwh) */
    unsigned int CIA:1;                     /**< \brief [3:3] Communication Indicator Channel A (rwh) */
    unsigned int SBVA:1;                    /**< \brief [4:4] Slot Boundary Violation on Channel A (vSS!BViolationA) (rwh) */
    unsigned int reserved_5:3;              /**< \brief \internal Reserved */
    unsigned int VFRB:1;                    /**< \brief [8:8] Valid Frame Received on Channel B (vSS!ValidFrameB) (rwh) */
    unsigned int SEDB:1;                    /**< \brief [9:9] Syntax Error Detected on Channel B (vSS!SyntaxErrorB) (rwh) */
    unsigned int CEDB:1;                    /**< \brief [10:10] Content Error Detected on Channel B (vSS!ContentErrorB) (rwh) */
    unsigned int CIB:1;                     /**< \brief [11:11] Communication Indicator Channel B (rwh) */
    unsigned int SBVB:1;                    /**< \brief [12:12] Slot Boundary Violation on Channel B (vSS!BViolationB) (rwh) */
    unsigned int reserved_13:19;            /**< \brief \internal Reserved */
} Ifx_ERAY_ACS_Bits;

/** \brief  Communication Controller Error Vector */
typedef struct _Ifx_ERAY_CCEV_Bits
{
    unsigned int CCFC:4;                    /**< \brief [3:0] Clock Correction Failed Counter (vClockCorrectionFailed) (rh) */
    unsigned int reserved_4:2;              /**< \brief \internal Reserved */
    unsigned int ERRM:2;                    /**< \brief [7:6] Error Mode (vPOC!ErrorMode) (rh) */
    unsigned int PTAC:5;                    /**< \brief [12:8] Passive to Active Count (vAllowPassiveToActive) (rh) */
    unsigned int reserved_13:19;            /**< \brief \internal Reserved */
} Ifx_ERAY_CCEV_Bits;

/** \brief  Communication Controller Status Vector */
typedef struct _Ifx_ERAY_CCSV_Bits
{
    unsigned int POCS:6;                    /**< \brief [5:0] Protocol Operation Control Status (rh) */
    unsigned int FSI:1;                     /**< \brief [6:6] Freeze Status Indicator (vPOC!Freeze) (rh) */
    unsigned int HRQ:1;                     /**< \brief [7:7] Halt Request (vPOC!CHIHaltRequest) (rh) */
    unsigned int SLM:2;                     /**< \brief [9:8] Slot Mode (vPOC!SlotMode) (rh) */
    unsigned int reserved_10:2;             /**< \brief \internal Reserved */
    unsigned int CSNI:1;                    /**< \brief [12:12] Coldstart Noise Indicator (vPOC!ColdstartNoise) (rh) */
    unsigned int CSAI:1;                    /**< \brief [13:13] Coldstart Abort Indicator (rh) */
    unsigned int CSI:1;                     /**< \brief [14:14] Cold Start Inhibit (vColdStartInhibit) (rh) */
    unsigned int reserved_15:1;             /**< \brief \internal Reserved */
    unsigned int WSV:3;                     /**< \brief [18:16] Wakeup Status (vPOC!WakeupStatus) (rh) */
    unsigned int RCA:5;                     /**< \brief [23:19] Remaining Coldstart Attempts (vRemainingColdstartAttempts) (rh) */
    unsigned int PSL:6;                     /**< \brief [29:24] POC Status Log (rh) */
    unsigned int reserved_30:2;             /**< \brief \internal Reserved */
} Ifx_ERAY_CCSV_Bits;

/** \brief  Clock Control Register */
typedef struct _Ifx_ERAY_CLC_Bits
{
    unsigned int DISR:1;                    /**< \brief [0:0] Module Disable Request Bit (rw) */
    unsigned int DISS:1;                    /**< \brief [1:1] Module Disable Status Bit (rh) */
    unsigned int reserved_2:1;              /**< \brief \internal Reserved */
    unsigned int EDIS:1;                    /**< \brief [3:3] External Sleep Mode Request Disable Bit (rw) */
    unsigned int reserved_4:4;              /**< \brief \internal Reserved */
    unsigned int RMC:3;                     /**< \brief [10:8] Clock Divider in Run Mode (rw) */
    unsigned int reserved_11:21;            /**< \brief \internal Reserved */
} Ifx_ERAY_CLC_Bits;

/** \brief  Core Release Register */
typedef struct _Ifx_ERAY_CREL_Bits
{
    unsigned int DAY:8;                     /**< \brief [7:0] Design Time Stamp, Day (r) */
    unsigned int MON:8;                     /**< \brief [15:8] Design Time Stamp, Month (r) */
    unsigned int YEAR:4;                    /**< \brief [19:16] Design Time Stamp, Year (r) */
    unsigned int SUBSTEP:4;                 /**< \brief [23:20] Sub-Step of Core Release (r) */
    unsigned int STEP:4;                    /**< \brief [27:24] Step of Core Release (r) */
    unsigned int REL:4;                     /**< \brief [31:28] Core Release (r) */
} Ifx_ERAY_CREL_Bits;

/** \brief  Busy and Input Buffer Control Register */
typedef struct _Ifx_ERAY_CUST1_Bits
{
    unsigned int INT0:1;                    /**< \brief [0:0] CIF Timeout Service Request Status (rwh) */
    unsigned int OEN:1;                     /**< \brief [1:1] Enable auto delay scheme for Output Buffer Control Register (OBCR) (rw) */
    unsigned int IEN:1;                     /**< \brief [2:2] Enable auto delay scheme for Input Buffer Control Register (IBCR) (rw) */
    unsigned int IBFS:1;                    /**< \brief [3:3] Input Buffer Status Register (rh) */
    unsigned int IBF1PAG:1;                 /**< \brief [4:4] Input Buffer 1 Page Select Register (rw) */
    unsigned int reserved_5:2;              /**< \brief \internal Reserved */
    unsigned int IBF2PAG:1;                 /**< \brief [7:7] Input Buffer 2 Page Select Register (rw) */
    unsigned int reserved_8:2;              /**< \brief \internal Reserved */
    unsigned int RISA:2;                    /**< \brief [11:10] Receive Input Select Channel A (rw) */
    unsigned int RISB:2;                    /**< \brief [13:12] Receive Input Select Channel B (rw) */
    unsigned int STPWTS:2;                  /**< \brief [15:14] Stop Watch Trigger Input Select (rw) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_ERAY_CUST1_Bits;

/** \brief  Customer Interface Timeout Counter */
typedef struct _Ifx_ERAY_CUST3_Bits
{
    unsigned int TO:32;                     /**< \brief [31:0] CIF Timeout Reload Value (rw) */
} Ifx_ERAY_CUST3_Bits;

/** \brief  Error Service Request Enable Reset */
typedef struct _Ifx_ERAY_EIER_Bits
{
    unsigned int PEMCE:1;                   /**< \brief [0:0] POC Error Mode Changed Service Request Enable (rwh) */
    unsigned int CNAE:1;                    /**< \brief [1:1] Command Not Accepted Service Request Enable (rwh) */
    unsigned int SFBME:1;                   /**< \brief [2:2] SYNC Frames Below Minimum Service Request Enable (rwh) */
    unsigned int SFOE:1;                    /**< \brief [3:3] SYNC Frame Overflow Service Request Enable (rwh) */
    unsigned int CCFE:1;                    /**< \brief [4:4] Clock Correction Failure Service Request Enable (rwh) */
    unsigned int CCLE:1;                    /**< \brief [5:5] CHI Command Locked Service Request Enable (rwh) */
    unsigned int EERRE:1;                   /**< \brief [6:6] ECC Error Service Request Enable (rwh) */
    unsigned int RFOE:1;                    /**< \brief [7:7] Receive FIFO Overrun Service Request Enable (rwh) */
    unsigned int EFAE:1;                    /**< \brief [8:8] Empty FIFO Access Service Request Enable (rwh) */
    unsigned int IIBAE:1;                   /**< \brief [9:9] Illegal Input Buffer Access Service Request Enable (rwh) */
    unsigned int IOBAE:1;                   /**< \brief [10:10] Illegal Output Buffer Access Service Request Enable (rwh) */
    unsigned int MHFE:1;                    /**< \brief [11:11] Message Handler Constraints Flag Service Request Enable (rwh) */
    unsigned int reserved_12:4;             /**< \brief \internal Reserved */
    unsigned int EDAE:1;                    /**< \brief [16:16] Error Detected on Channel A Service Request Enable (rwh) */
    unsigned int LTVAE:1;                   /**< \brief [17:17] Latest Transmit Violation Channel A Service Request Enable (rwh) */
    unsigned int TABAE:1;                   /**< \brief [18:18] Transmission Across Boundary Channel A Service Request Enable (rwh) */
    unsigned int reserved_19:5;             /**< \brief \internal Reserved */
    unsigned int EDBE:1;                    /**< \brief [24:24] Error Detected on Channel B Service Request Enable (rwh) */
    unsigned int LTVBE:1;                   /**< \brief [25:25] Latest Transmit Violation Channel B Service Request Enable (rwh) */
    unsigned int TABBE:1;                   /**< \brief [26:26] Transmission Across Boundary Channel B Service Request Enable (rwh) */
    unsigned int reserved_27:5;             /**< \brief \internal Reserved */
} Ifx_ERAY_EIER_Bits;

/** \brief  Error Service Request Enable Set */
typedef struct _Ifx_ERAY_EIES_Bits
{
    unsigned int PEMCE:1;                   /**< \brief [0:0] POC Error Mode Changed Service Request Enable (rwh) */
    unsigned int CNAE:1;                    /**< \brief [1:1] Command Not Accepted Service Request Enable (rwh) */
    unsigned int SFBME:1;                   /**< \brief [2:2] SYNC Frames Below Minimum Service Request Enable (rwh) */
    unsigned int SFOE:1;                    /**< \brief [3:3] SYNC Frame Overflow Service Request Enable (rwh) */
    unsigned int CCFE:1;                    /**< \brief [4:4] Clock Correction Failure Service Request Enable (rwh) */
    unsigned int CCLE:1;                    /**< \brief [5:5] CHI Command Locked Service Request Enable (rwh) */
    unsigned int EERRE:1;                   /**< \brief [6:6] ECC Error Service Request Enable (rwh) */
    unsigned int RFOE:1;                    /**< \brief [7:7] Receive FIFO Overrun Service Request Enable (rwh) */
    unsigned int EFAE:1;                    /**< \brief [8:8] Empty FIFO Access Service Request Enable (rwh) */
    unsigned int IIBAE:1;                   /**< \brief [9:9] Illegal Input Buffer Access Service Request Enable (rwh) */
    unsigned int IOBAE:1;                   /**< \brief [10:10] Illegal Output Buffer Access Service Request Enable (rwh) */
    unsigned int MHFE:1;                    /**< \brief [11:11] Message Handler Constraints Flag Service Request Enable (rwh) */
    unsigned int reserved_12:4;             /**< \brief \internal Reserved */
    unsigned int EDAE:1;                    /**< \brief [16:16] Error Detected on Channel A Service Request Enable (rwh) */
    unsigned int LTVAE:1;                   /**< \brief [17:17] Latest Transmit Violation Channel A Service Request Enable (rwh) */
    unsigned int TABAE:1;                   /**< \brief [18:18] Transmission Across Boundary Channel A Service Request Enable (rwh) */
    unsigned int reserved_19:5;             /**< \brief \internal Reserved */
    unsigned int EDBE:1;                    /**< \brief [24:24] Error Detected on Channel B Service Request Enable (rwh) */
    unsigned int LTVBE:1;                   /**< \brief [25:25] Latest Transmit Violation Channel B Service Request Enable (rwh) */
    unsigned int TABBE:1;                   /**< \brief [26:26] Transmission Across Boundary Channel B Service Request Enable (rwh) */
    unsigned int reserved_27:5;             /**< \brief \internal Reserved */
} Ifx_ERAY_EIES_Bits;

/** \brief  Error Service Request Line Select */
typedef struct _Ifx_ERAY_EILS_Bits
{
    unsigned int PEMCL:1;                   /**< \brief [0:0] POC Error Mode Changed Service Request Line (rw) */
    unsigned int CNAL:1;                    /**< \brief [1:1] Command Not Accepted Service Request Line (rw) */
    unsigned int SFBML:1;                   /**< \brief [2:2] SYNC Frames Below Minimum Service Request Line (rw) */
    unsigned int SFOL:1;                    /**< \brief [3:3] SYNC Frame Overflow Service Request Line (rw) */
    unsigned int CCFL:1;                    /**< \brief [4:4] Clock Correction Failure Service Request Line (rw) */
    unsigned int CCLL:1;                    /**< \brief [5:5] CHI Command Locked Service Request Line (rw) */
    unsigned int EERRL:1;                   /**< \brief [6:6] ECC Error Service Request Line (rw) */
    unsigned int RFOL:1;                    /**< \brief [7:7] Receive FIFO Overrun Service Request Line (rw) */
    unsigned int EFAL:1;                    /**< \brief [8:8] Empty FIFO Access Service Request Line (rw) */
    unsigned int IIBAL:1;                   /**< \brief [9:9] Illegal Input Buffer Access Service Request Line (rw) */
    unsigned int IOBAL:1;                   /**< \brief [10:10] Illegal Output Buffer Access Service Request Line (rw) */
    unsigned int MHFL:1;                    /**< \brief [11:11] Message Handler Constrains Flag Service Request Line (rw) */
    unsigned int reserved_12:4;             /**< \brief \internal Reserved */
    unsigned int EDAL:1;                    /**< \brief [16:16] Error Detected on Channel A Service Request Line (rw) */
    unsigned int LTVAL:1;                   /**< \brief [17:17] Latest Transmit Violation Channel A Service Request Line (rw) */
    unsigned int TABAL:1;                   /**< \brief [18:18] Transmission Across Boundary Channel A Service Request Line (rw) */
    unsigned int reserved_19:5;             /**< \brief \internal Reserved */
    unsigned int EDBL:1;                    /**< \brief [24:24] Error Detected on Channel B Service Request Line (rw) */
    unsigned int LTVBL:1;                   /**< \brief [25:25] Latest Transmit Violation Channel B Service Request Line (rw) */
    unsigned int TABBL:1;                   /**< \brief [26:26] Transmission Across Boundary Channel A Service Request Line (rw) */
    unsigned int reserved_27:5;             /**< \brief \internal Reserved */
} Ifx_ERAY_EILS_Bits;

/** \brief  Error Service Request Register */
typedef struct _Ifx_ERAY_EIR_Bits
{
    unsigned int PEMC:1;                    /**< \brief [0:0] POC Error Mode Changed (rwh) */
    unsigned int CNA:1;                     /**< \brief [1:1] Command Not Accepted (rwh) */
    unsigned int SFBM:1;                    /**< \brief [2:2] SYNC Frames Below Minimum (rwh) */
    unsigned int SFO:1;                     /**< \brief [3:3] SYNC Frame Overflow (rwh) */
    unsigned int CCF:1;                     /**< \brief [4:4] Clock Correction Failure (rwh) */
    unsigned int CCL:1;                     /**< \brief [5:5] CHI Command Locked (rwh) */
    unsigned int EERR:1;                    /**< \brief [6:6] ECC Error (rh) */
    unsigned int RFO:1;                     /**< \brief [7:7] Receive FIFO Overrun (rh) */
    unsigned int EFA:1;                     /**< \brief [8:8] Empty FIFO Access (rwh) */
    unsigned int IIBA:1;                    /**< \brief [9:9] Illegal Input Buffer Access (rwh) */
    unsigned int IOBA:1;                    /**< \brief [10:10] Illegal Output Buffer Access (rwh) */
    unsigned int MHF:1;                     /**< \brief [11:11] Message Handler Constraints Flag (rwh) */
    unsigned int reserved_12:4;             /**< \brief \internal Reserved */
    unsigned int EDA:1;                     /**< \brief [16:16] Error Detected on Channel A (rwh) */
    unsigned int LTVA:1;                    /**< \brief [17:17] Latest Transmit Violation Channel A (rwh) */
    unsigned int TABA:1;                    /**< \brief [18:18] Transmission Across Boundary Channel A (rwh) */
    unsigned int reserved_19:5;             /**< \brief \internal Reserved */
    unsigned int EDB:1;                     /**< \brief [24:24] Error Detected on Channel B (rwh) */
    unsigned int LTVB:1;                    /**< \brief [25:25] Latest Transmit Violation Channel B (rwh) */
    unsigned int TABB:1;                    /**< \brief [26:26] Transmission Across Boundary Channel B (rwh) */
    unsigned int reserved_27:5;             /**< \brief \internal Reserved */
} Ifx_ERAY_EIR_Bits;

/** \brief  Endian Register */
typedef struct _Ifx_ERAY_ENDN_Bits
{
    unsigned int ETV:32;                    /**< \brief [31:0] Endianness Test Value (r) */
} Ifx_ERAY_ENDN_Bits;

/** \brief  Even Sync ID Symbol Window */
typedef struct _Ifx_ERAY_ESID_Bits
{
    unsigned int EID:10;                    /**< \brief [9:0] Even Sync ID (vsSyncIDListA,B even) (rh) */
    unsigned int reserved_10:4;             /**< \brief \internal Reserved */
    unsigned int RXEA:1;                    /**< \brief [14:14] Received/Configured Even Sync ID on Channel A (rh) */
    unsigned int RXEB:1;                    /**< \brief [15:15] Received/Configured Even Sync ID on Channel B (rh) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_ERAY_ESID_Bits;

/** \brief  FIFO Critical Level */
typedef struct _Ifx_ERAY_FCL_Bits
{
    unsigned int CL:8;                      /**< \brief [7:0] Critical Level (rw) */
    unsigned int reserved_8:24;             /**< \brief \internal Reserved */
} Ifx_ERAY_FCL_Bits;

/** \brief  FIFO Rejection Filter */
typedef struct _Ifx_ERAY_FRF_Bits
{
    unsigned int CH:2;                      /**< \brief [1:0] Channel Filter (rw) */
    unsigned int FID:11;                    /**< \brief [12:2] Frame ID Filter (rw) */
    unsigned int reserved_13:3;             /**< \brief \internal Reserved */
    unsigned int CYF:7;                     /**< \brief [22:16] Cycle Counter Filter (rw) */
    unsigned int RSS:1;                     /**< \brief [23:23] Reject in Static Segment (rw) */
    unsigned int RNF:1;                     /**< \brief [24:24] Reject NULL Frames (rw) */
    unsigned int reserved_25:7;             /**< \brief \internal Reserved */
} Ifx_ERAY_FRF_Bits;

/** \brief  FIFO Rejection Filter Mask */
typedef struct _Ifx_ERAY_FRFM_Bits
{
    unsigned int reserved_0:2;              /**< \brief \internal Reserved */
    unsigned int MFID:11;                   /**< \brief [12:2] Mask Frame ID Filter (rw) */
    unsigned int reserved_13:19;            /**< \brief \internal Reserved */
} Ifx_ERAY_FRFM_Bits;

/** \brief  FIFO Status Register */
typedef struct _Ifx_ERAY_FSR_Bits
{
    unsigned int RFNE:1;                    /**< \brief [0:0] Receive FIFO Not Empty (rh) */
    unsigned int RFCL:1;                    /**< \brief [1:1] Receive FIFO Critical Level (rh) */
    unsigned int RFO:1;                     /**< \brief [2:2] Receive FIFO Overrun (rh) */
    unsigned int reserved_3:5;              /**< \brief \internal Reserved */
    unsigned int RFFL:8;                    /**< \brief [15:8] Receive FIFO Fill Level (rh) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_ERAY_FSR_Bits;

/** \brief  GTU Configuration Register 1 */
typedef struct _Ifx_ERAY_GTUC01_Bits
{
    unsigned int UT:20;                     /**< \brief [19:0] Microtick per Cycle (pMicroPerCycle) (rw) */
    unsigned int reserved_20:12;            /**< \brief \internal Reserved */
} Ifx_ERAY_GTUC01_Bits;

/** \brief  GTU Configuration Register 2 */
typedef struct _Ifx_ERAY_GTUC02_Bits
{
    unsigned int MPC:14;                    /**< \brief [13:0] Macrotick Per Cycle (gMacroPerCycle) (rw) */
    unsigned int reserved_14:2;             /**< \brief \internal Reserved */
    unsigned int SNM:4;                     /**< \brief [19:16] Sync Node Max (gSyncNodeMax) (rw) */
    unsigned int reserved_20:12;            /**< \brief \internal Reserved */
} Ifx_ERAY_GTUC02_Bits;

