feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Boot/Libraries/Infra/Sfr/TC27D/_Reg/IfxEray_regdef.h
/** \brief  Kernel Reset Status Clear Register */
typedef struct _Ifx_ERAY_KRSTCLR_Bits
{
    unsigned int CLR:1;                     /**< \brief [0:0] Kernel Reset Status Clear (w) */
    unsigned int reserved_1:31;             /**< \brief \internal Reserved */
} Ifx_ERAY_KRSTCLR_Bits;

/** \brief  Lock Register */
typedef struct _Ifx_ERAY_LCK_Bits
{
    unsigned int CLK:8;                     /**< \brief [7:0] Configuration Lock Key (w) */
    unsigned int TMK:8;                     /**< \brief [15:8] Test Mode Key (w) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_ERAY_LCK_Bits;

/** \brief  Last Dynamic Transmit Slot */
typedef struct _Ifx_ERAY_LDTS_Bits
{
    unsigned int LDTA:11;                   /**< \brief [10:0] Last Dynamic Transmission Channel A (rh) */
    unsigned int reserved_11:5;             /**< \brief \internal Reserved */
    unsigned int LDTB:11;                   /**< \brief [26:16] Last Dynamic Transmission Channel B (rh) */
    unsigned int reserved_27:5;             /**< \brief \internal Reserved */
} Ifx_ERAY_LDTS_Bits;

/** \brief  Message Buffer Status */
typedef struct _Ifx_ERAY_MBS_Bits
{
    unsigned int VFRA:1;                    /**< \brief [0:0] Valid Frame Received on Channel A (vSS!ValidFrameA) (rh) */
    unsigned int VFRB:1;                    /**< \brief [1:1] Valid Frame Received on Channel B (vSS!ValidFrameB) (rh) */
    unsigned int SEOA:1;                    /**< \brief [2:2] Syntax Error Observed on Channel A (vSS!SyntaxErrorA) (rh) */
    unsigned int SEOB:1;                    /**< \brief [3:3] Syntax Error Observed on Channel B (vSS!SyntaxErrorB) (rh) */
    unsigned int CEOA:1;                    /**< \brief [4:4] Content Error Observed on Channel A (vSS!ContentErrorA) (rh) */
    unsigned int CEOB:1;                    /**< \brief [5:5] Content Error Observed on Channel B (vSS!ContentErrorB) (rh) */
    unsigned int SVOA:1;                    /**< \brief [6:6] Slot Boundary Violation Observed on Channel A (vSS!BViolationA) (rh) */
    unsigned int SVOB:1;                    /**< \brief [7:7] Slot Boundary Violation Observed on Channel B (vSS!BViolationB) (rh) */
    unsigned int TCIA:1;                    /**< \brief [8:8] Transmission Conflict Indication Channel A (vSS!TxConflictA) (rh) */
    unsigned int TCIB:1;                    /**< \brief [9:9] Transmission Conflict Indication Channel B (vSS!TxConflictB) (rh) */
    unsigned int ESA:1;                     /**< \brief [10:10] Empty Slot Channel A (rh) */
    unsigned int ESB:1;                     /**< \brief [11:11] Empty Slot Channel B (rh) */
    unsigned int MLST:1;                    /**< \brief [12:12] Message Lost (rh) */
    unsigned int reserved_13:1;             /**< \brief \internal Reserved */
    unsigned int FTA:1;                     /**< \brief [14:14] Frame Transmitted on Channel A (rh) */
    unsigned int FTB:1;                     /**< \brief [15:15] Frame Transmitted on Channel B (rh) */
    unsigned int CCS:6;                     /**< \brief [21:16] Cycle Count Status (rh) */
    unsigned int reserved_22:2;             /**< \brief \internal Reserved */
    unsigned int RCIS:1;                    /**< \brief [24:24] Received on Channel Indicator Status (vSS!Channel) (rh) */
    unsigned int SFIS:1;                    /**< \brief [25:25] Startup Frame Indicator Status (vRF!Header!SuFIndicator) (rh) */
    unsigned int SYNS:1;                    /**< \brief [26:26] SYNC Frame Indicator Status (vRF!Header!SyFIndicator) (rh) */
    unsigned int NFIS:1;                    /**< \brief [27:27] NULL Frame Indicator Status (vRF!Header!NFIndicator) (rh) */
    unsigned int PPIS:1;                    /**< \brief [28:28] Payload Preamble Indictor Status (vRF!Header!PPIndicator) (rh) */
    unsigned int RESS:1;                    /**< \brief [29:29] Reserved Bit Status (vRF!Header!Reserved) (rh) */
    unsigned int reserved_30:2;             /**< \brief \internal Reserved */
} Ifx_ERAY_MBS_Bits;

/** \brief  Message Buffer Status Changed 1 */
typedef struct _Ifx_ERAY_MBSC1_Bits
{
    unsigned int MBC0:1;                    /**< \brief [0:0] Message Buffer Status Changed 0 (0 = 0-31) (rh) */
    unsigned int MBC1:1;                    /**< \brief [1:1] Message Buffer Status Changed 1 (1 = 0-31) (rh) */
    unsigned int MBC2:1;                    /**< \brief [2:2] Message Buffer Status Changed 2 (2 = 0-31) (rh) */
    unsigned int MBC3:1;                    /**< \brief [3:3] Message Buffer Status Changed 3 (3 = 0-31) (rh) */
    unsigned int MBC4:1;                    /**< \brief [4:4] Message Buffer Status Changed 4 (4 = 0-31) (rh) */
    unsigned int MBC5:1;                    /**< \brief [5:5] Message Buffer Status Changed 5 (5 = 0-31) (rh) */
    unsigned int MBC6:1;                    /**< \brief [6:6] Message Buffer Status Changed 6 (6 = 0-31) (rh) */
    unsigned int MBC7:1;                    /**< \brief [7:7] Message Buffer Status Changed 7 (7 = 0-31) (rh) */
    unsigned int MBC8:1;                    /**< \brief [8:8] Message Buffer Status Changed 8 (8 = 0-31) (rh) */
    unsigned int MBC9:1;                    /**< \brief [9:9] Message Buffer Status Changed 9 (9 = 0-31) (rh) */
    unsigned int MBC10:1;                   /**< \brief [10:10] Message Buffer Status Changed 10 (10 = 0-31) (rh) */
    unsigned int MBC11:1;                   /**< \brief [11:11] Message Buffer Status Changed 11 (11 = 0-31) (rh) */
    unsigned int MBC12:1;                   /**< \brief [12:12] Message Buffer Status Changed 12 (12 = 0-31) (rh) */
    unsigned int MBC13:1;                   /**< \brief [13:13] Message Buffer Status Changed 13 (13 = 0-31) (rh) */
    unsigned int MBC14:1;                   /**< \brief [14:14] Message Buffer Status Changed 14 (14 = 0-31) (rh) */
    unsigned int MBC15:1;                   /**< \brief [15:15] Message Buffer Status Changed 15 (15 = 0-31) (rh) */
    unsigned int MBC16:1;                   /**< \brief [16:16] Message Buffer Status Changed 16 (16 = 0-31) (rh) */
    unsigned int MBC17:1;                   /**< \brief [17:17] Message Buffer Status Changed 17 (17 = 0-31) (rh) */
    unsigned int MBC18:1;                   /**< \brief [18:18] Message Buffer Status Changed 18 (18 = 0-31) (rh) */
    unsigned int MBC19:1;                   /**< \brief [19:19] Message Buffer Status Changed 19 (19 = 0-31) (rh) */
    unsigned int MBC20:1;                   /**< \brief [20:20] Message Buffer Status Changed 20 (20 = 0-31) (rh) */
    unsigned int MBC21:1;                   /**< \brief [21:21] Message Buffer Status Changed 21 (21 = 0-31) (rh) */
    unsigned int MBC22:1;                   /**< \brief [22:22] Message Buffer Status Changed 22 (22 = 0-31) (rh) */
    unsigned int MBC23:1;                   /**< \brief [23:23] Message Buffer Status Changed 23 (23 = 0-31) (rh) */
    unsigned int MBC24:1;                   /**< \brief [24:24] Message Buffer Status Changed 24 (24 = 0-31) (rh) */
    unsigned int MBC25:1;                   /**< \brief [25:25] Message Buffer Status Changed 25 (25 = 0-31) (rh) */
    unsigned int MBC26:1;                   /**< \brief [26:26] Message Buffer Status Changed 26 (26 = 0-31) (rh) */
    unsigned int MBC27:1;                   /**< \brief [27:27] Message Buffer Status Changed 27 (27 = 0-31) (rh) */
    unsigned int MBC28:1;                   /**< \brief [28:28] Message Buffer Status Changed 28 (28 = 0-31) (rh) */
    unsigned int MBC29:1;                   /**< \brief [29:29] Message Buffer Status Changed 29 (29 = 0-31) (rh) */
    unsigned int MBC30:1;                   /**< \brief [30:30] Message Buffer Status Changed 30 (30 = 0-31) (rh) */
    unsigned int MBC31:1;                   /**< \brief [31:31] Message Buffer Status Changed 31 (31 = 0-31) (rh) */
} Ifx_ERAY_MBSC1_Bits;

