feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Boot/Libraries/Infra/Sfr/TC27D/_Reg/IfxEray_regdef.h
/** \brief  Message Buffer Status Changed 2 */
typedef struct _Ifx_ERAY_MBSC2_Bits
{
    unsigned int MBC32:1;                   /**< \brief [0:0] Message Buffer Status Changed 32 (32 = 32-63) (rh) */
    unsigned int MBC33:1;                   /**< \brief [1:1] Message Buffer Status Changed 33 (33 = 32-63) (rh) */
    unsigned int MBC34:1;                   /**< \brief [2:2] Message Buffer Status Changed 34 (34 = 32-63) (rh) */
    unsigned int MBC35:1;                   /**< \brief [3:3] Message Buffer Status Changed 35 (35 = 32-63) (rh) */
    unsigned int MBC36:1;                   /**< \brief [4:4] Message Buffer Status Changed 36 (36 = 32-63) (rh) */
    unsigned int MBC37:1;                   /**< \brief [5:5] Message Buffer Status Changed 37 (37 = 32-63) (rh) */
    unsigned int MBC38:1;                   /**< \brief [6:6] Message Buffer Status Changed 38 (38 = 32-63) (rh) */
    unsigned int MBC39:1;                   /**< \brief [7:7] Message Buffer Status Changed 39 (39 = 32-63) (rh) */
    unsigned int MBC40:1;                   /**< \brief [8:8] Message Buffer Status Changed 40 (40 = 32-63) (rh) */
    unsigned int MBC41:1;                   /**< \brief [9:9] Message Buffer Status Changed 41 (41 = 32-63) (rh) */
    unsigned int MBC42:1;                   /**< \brief [10:10] Message Buffer Status Changed 42 (42 = 32-63) (rh) */
    unsigned int MBC43:1;                   /**< \brief [11:11] Message Buffer Status Changed 43 (43 = 32-63) (rh) */
    unsigned int MBC44:1;                   /**< \brief [12:12] Message Buffer Status Changed 44 (44 = 32-63) (rh) */
    unsigned int MBC45:1;                   /**< \brief [13:13] Message Buffer Status Changed 45 (45 = 32-63) (rh) */
    unsigned int MBC46:1;                   /**< \brief [14:14] Message Buffer Status Changed 46 (46 = 32-63) (rh) */
    unsigned int MBC47:1;                   /**< \brief [15:15] Message Buffer Status Changed 47 (47 = 32-63) (rh) */
    unsigned int MBC48:1;                   /**< \brief [16:16] Message Buffer Status Changed 48 (48 = 32-63) (rh) */
    unsigned int MBC49:1;                   /**< \brief [17:17] Message Buffer Status Changed 49 (49 = 32-63) (rh) */
    unsigned int MBC50:1;                   /**< \brief [18:18] Message Buffer Status Changed 50 (50 = 32-63) (rh) */
    unsigned int MBC51:1;                   /**< \brief [19:19] Message Buffer Status Changed 51 (51 = 32-63) (rh) */
    unsigned int MBC52:1;                   /**< \brief [20:20] Message Buffer Status Changed 52 (52 = 32-63) (rh) */
    unsigned int MBC53:1;                   /**< \brief [21:21] Message Buffer Status Changed 53 (53 = 32-63) (rh) */
    unsigned int MBC54:1;                   /**< \brief [22:22] Message Buffer Status Changed 54 (54 = 32-63) (rh) */
    unsigned int MBC55:1;                   /**< \brief [23:23] Message Buffer Status Changed 55 (55 = 32-63) (rh) */
    unsigned int MBC56:1;                   /**< \brief [24:24] Message Buffer Status Changed 56 (56 = 32-63) (rh) */
    unsigned int MBC57:1;                   /**< \brief [25:25] Message Buffer Status Changed 57 (57 = 32-63) (rh) */
    unsigned int MBC58:1;                   /**< \brief [26:26] Message Buffer Status Changed 58 (58 = 32-63) (rh) */
    unsigned int MBC59:1;                   /**< \brief [27:27] Message Buffer Status Changed 59 (59 = 32-63) (rh) */
    unsigned int MBC60:1;                   /**< \brief [28:28] Message Buffer Status Changed 60 (60 = 32-63) (rh) */
    unsigned int MBC61:1;                   /**< \brief [29:29] Message Buffer Status Changed 61 (61 = 32-63) (rh) */
    unsigned int MBC62:1;                   /**< \brief [30:30] Message Buffer Status Changed 62 (62 = 32-63) (rh) */
    unsigned int MBC63:1;                   /**< \brief [31:31] Message Buffer Status Changed 63 (63 = 32-63) (rh) */
} Ifx_ERAY_MBSC2_Bits;

/** \brief  Message Buffer Status Changed 3 */
typedef struct _Ifx_ERAY_MBSC3_Bits
{
    unsigned int MBC64:1;                   /**< \brief [0:0] Message Buffer Status Changed 64 (64 = 64-95) (rh) */
    unsigned int MBC65:1;                   /**< \brief [1:1] Message Buffer Status Changed 65 (65 = 64-95) (rh) */
    unsigned int MBC66:1;                   /**< \brief [2:2] Message Buffer Status Changed 66 (66 = 64-95) (rh) */
    unsigned int MBC67:1;                   /**< \brief [3:3] Message Buffer Status Changed 67 (67 = 64-95) (rh) */
    unsigned int MBC68:1;                   /**< \brief [4:4] Message Buffer Status Changed 68 (68 = 64-95) (rh) */
    unsigned int MBC69:1;                   /**< \brief [5:5] Message Buffer Status Changed 69 (69 = 64-95) (rh) */
    unsigned int MBC70:1;                   /**< \brief [6:6] Message Buffer Status Changed 70 (70 = 64-95) (rh) */
    unsigned int MBC71:1;                   /**< \brief [7:7] Message Buffer Status Changed 71 (71 = 64-95) (rh) */
    unsigned int MBC72:1;                   /**< \brief [8:8] Message Buffer Status Changed 72 (72 = 64-95) (rh) */
    unsigned int MBC73:1;                   /**< \brief [9:9] Message Buffer Status Changed 73 (73 = 64-95) (rh) */
    unsigned int MBC74:1;                   /**< \brief [10:10] Message Buffer Status Changed 74 (74 = 64-95) (rh) */
    unsigned int MBC75:1;                   /**< \brief [11:11] Message Buffer Status Changed 75 (75 = 64-95) (rh) */
    unsigned int MBC76:1;                   /**< \brief [12:12] Message Buffer Status Changed 76 (76 = 64-95) (rh) */
    unsigned int MBC77:1;                   /**< \brief [13:13] Message Buffer Status Changed 77 (77 = 64-95) (rh) */
    unsigned int MBC78:1;                   /**< \brief [14:14] Message Buffer Status Changed 78 (78 = 64-95) (rh) */
    unsigned int MBC79:1;                   /**< \brief [15:15] Message Buffer Status Changed 79 (79 = 64-95) (rh) */
    unsigned int MBC80:1;                   /**< \brief [16:16] Message Buffer Status Changed 80 (80 = 64-95) (rh) */
    unsigned int MBC81:1;                   /**< \brief [17:17] Message Buffer Status Changed 81 (81 = 64-95) (rh) */
    unsigned int MBC82:1;                   /**< \brief [18:18] Message Buffer Status Changed 82 (82 = 64-95) (rh) */
    unsigned int MBC83:1;                   /**< \brief [19:19] Message Buffer Status Changed 83 (83 = 64-95) (rh) */
    unsigned int MBC84:1;                   /**< \brief [20:20] Message Buffer Status Changed 84 (84 = 64-95) (rh) */
    unsigned int MBC85:1;                   /**< \brief [21:21] Message Buffer Status Changed 85 (85 = 64-95) (rh) */
    unsigned int MBC86:1;                   /**< \brief [22:22] Message Buffer Status Changed 86 (86 = 64-95) (rh) */
    unsigned int MBC87:1;                   /**< \brief [23:23] Message Buffer Status Changed 87 (87 = 64-95) (rh) */
    unsigned int MBC88:1;                   /**< \brief [24:24] Message Buffer Status Changed 88 (88 = 64-95) (rh) */
    unsigned int MBC89:1;                   /**< \brief [25:25] Message Buffer Status Changed 89 (89 = 64-95) (rh) */
    unsigned int MBC90:1;                   /**< \brief [26:26] Message Buffer Status Changed 90 (90 = 64-95) (rh) */
    unsigned int MBC91:1;                   /**< \brief [27:27] Message Buffer Status Changed 91 (91 = 64-95) (rh) */
    unsigned int MBC92:1;                   /**< \brief [28:28] Message Buffer Status Changed 92 (92 = 64-95) (rh) */
    unsigned int MBC93:1;                   /**< \brief [29:29] Message Buffer Status Changed 93 (93 = 64-95) (rh) */
    unsigned int MBC94:1;                   /**< \brief [30:30] Message Buffer Status Changed 94 (94 = 64-95) (rh) */
    unsigned int MBC95:1;                   /**< \brief [31:31] Message Buffer Status Changed 95 (95 = 64-95) (rh) */
} Ifx_ERAY_MBSC3_Bits;

