feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Boot/Libraries/Infra/Sfr/TC27D/_Reg/IfxEray_regdef.h
/** \brief  Network Management Vector */
typedef struct _Ifx_ERAY_NMV_Bits
{
    unsigned int NM:32;                     /**< \brief [31:0] Network Management Vector (rh) */
} Ifx_ERAY_NMV_Bits;

/** \brief  Output Buffer Command Mask */
typedef struct _Ifx_ERAY_OBCM_Bits
{
    unsigned int RHSS:1;                    /**< \brief [0:0] Read Header Section Shadow (rwh) */
    unsigned int RDSS:1;                    /**< \brief [1:1] Read Data Section Shadow (rwh) */
    unsigned int reserved_2:14;             /**< \brief \internal Reserved */
    unsigned int RHSH:1;                    /**< \brief [16:16] Read Header Section Host (rh) */
    unsigned int RDSH:1;                    /**< \brief [17:17] Read Data Section Host (rh) */
    unsigned int reserved_18:14;            /**< \brief \internal Reserved */
} Ifx_ERAY_OBCM_Bits;

/** \brief  Output Buffer Command Request */
typedef struct _Ifx_ERAY_OBCR_Bits
{
    unsigned int OBRS:7;                    /**< \brief [6:0] Output Buffer Request Shadow (rw) */
    unsigned int reserved_7:1;              /**< \brief \internal Reserved */
    unsigned int VIEW:1;                    /**< \brief [8:8] View Shadow Buffer (rw) */
    unsigned int REQ:1;                     /**< \brief [9:9] Request Message RAM Transfer (rw) */
    unsigned int reserved_10:5;             /**< \brief \internal Reserved */
    unsigned int OBSYS:1;                   /**< \brief [15:15] Output Buffer Busy Shadow (rh) */
    unsigned int OBRH:7;                    /**< \brief [22:16] Output Buffer Request Host (rh) */
    unsigned int reserved_23:9;             /**< \brief \internal Reserved */
} Ifx_ERAY_OBCR_Bits;

/** \brief  OCDS Control and Status */
typedef struct _Ifx_ERAY_OCS_Bits
{
    unsigned int reserved_0:24;             /**< \brief \internal Reserved */
    unsigned int SUS:4;                     /**< \brief [27:24] OCDS Suspend Control (rw) */
    unsigned int SUS_P:1;                   /**< \brief [28:28] SUS Write Protection (w) */
    unsigned int SUSSTA:1;                  /**< \brief [29:29] Suspend State (rh) */
    unsigned int reserved_30:2;             /**< \brief \internal Reserved */
} Ifx_ERAY_OCS_Bits;

/** \brief  Offset Correction Value */
typedef struct _Ifx_ERAY_OCV_Bits
{
    unsigned int OCV:19;                    /**< \brief [18:0] Offset Correction Value (vOffsetCorrection) (rh) */
    unsigned int reserved_19:13;            /**< \brief \internal Reserved */
} Ifx_ERAY_OCV_Bits;

/** \brief  Odd Sync ID Symbol Window */
typedef struct _Ifx_ERAY_OSID_Bits
{
    unsigned int OID:10;                    /**< \brief [9:0] Odd Sync ID (vsSyncIDListA,B odd) (rh) */
    unsigned int reserved_10:4;             /**< \brief \internal Reserved */
    unsigned int RXOA:1;                    /**< \brief [14:14] Received Odd Sync ID on Channel A (rh) */
    unsigned int RXOB:1;                    /**< \brief [15:15] Received Odd Sync ID on Channel B (rh) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_ERAY_OSID_Bits;

/** \brief  OCDS Trigger Set Select */
typedef struct _Ifx_ERAY_OTSS_Bits
{
    unsigned int OTGB0:2;                   /**< \brief [1:0] Trigger Set for OTGB0 (rw) */
    unsigned int reserved_2:6;              /**< \brief \internal Reserved */
    unsigned int OTGB1:2;                   /**< \brief [9:8] Trigger Set for OTGB1 (rw) */
    unsigned int reserved_10:6;             /**< \brief \internal Reserved */
    unsigned int OTGB2:1;                   /**< \brief [16:16] Trigger Set for OTGB2 (rw) */
    unsigned int reserved_17:15;            /**< \brief \internal Reserved */
} Ifx_ERAY_OTSS_Bits;

/** \brief  PRT Configuration Register 1 */
typedef struct _Ifx_ERAY_PRTC1_Bits
{
    unsigned int TSST:4;                    /**< \brief [3:0] Transmission Start Sequence Transmitter (gdTSSTransmitter) (rw) */
    unsigned int CASM:7;                    /**< \brief [10:4] Collision Avoidance Symbol Maximum(gdCASRxLowMax) (rw) */
    unsigned int reserved_11:1;             /**< \brief \internal Reserved */
    unsigned int SPP:2;                     /**< \brief [13:12] Strobe Point Position (rw) */
    unsigned int BRP:2;                     /**< \brief [15:14] Baud Rate Prescaler(gdSampleClockPeriod, pSamplePerMicrotick) (rw) */
    unsigned int RXW:9;                     /**< \brief [24:16] Wakeup Symbol Receive Window Length (gdWakeupSymbolRxWindow) (rw) */
    unsigned int reserved_25:1;             /**< \brief \internal Reserved */
    unsigned int RWP:6;                     /**< \brief [31:26] Repetitions of Tx Wakeup Pattern (pWakeupPattern) (rw) */
} Ifx_ERAY_PRTC1_Bits;

/** \brief  PRT Configuration Register 2 */
typedef struct _Ifx_ERAY_PRTC2_Bits
{
    unsigned int RXI:6;                     /**< \brief [5:0] Wakeup Symbol Receive Idle (gdWakeupSymbolRxIdle) (rw) */
    unsigned int reserved_6:2;              /**< \brief \internal Reserved */
    unsigned int RXL:6;                     /**< \brief [13:8] Wakeup Symbol Receive Low(gdWakeupSymbolRxLow) (rw) */
    unsigned int reserved_14:2;             /**< \brief \internal Reserved */
    unsigned int TXI:8;                     /**< \brief [23:16] Wakeup Symbol Transmit Idle (gdWakeupSymbolTxIdle) (rw) */
    unsigned int TXL:6;                     /**< \brief [29:24] Wakeup Symbol Transmit Low (gdWakeupSymbolTxLow) (rw) */
    unsigned int reserved_30:2;             /**< \brief \internal Reserved */
} Ifx_ERAY_PRTC2_Bits;

/** \brief  Rate Correction Value */
typedef struct _Ifx_ERAY_RCV_Bits
{
    unsigned int RCV:12;                    /**< \brief [11:0] Rate Correction Value (vRateCorrection) (rh) */
    unsigned int reserved_12:20;            /**< \brief \internal Reserved */
} Ifx_ERAY_RCV_Bits;

/** \brief  Read Data Section */
typedef struct _Ifx_ERAY_RDDS_Bits
{
    unsigned int MDRB0:8;                   /**< \brief [7:0] 32-Bit Word nn, Byte 0 (rh) */
    unsigned int MDRB1:8;                   /**< \brief [15:8] 32-Bit Word nn, Byte 1 (rh) */
    unsigned int MDRB2:8;                   /**< \brief [23:16] 32-Bit Word nn, Byte 2 (rh) */
    unsigned int MDRB3:8;                   /**< \brief [31:24] 32-Bit Word nn, Byte 3 (rh) */
} Ifx_ERAY_RDDS_Bits;

