feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Boot/Libraries/Infra/Sfr/TC27D/_Reg/IfxEray_regdef.h
/** \brief  GTU Configuration Register 3 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_GTUC03_Bits B;                 /**< \brief Bitfield access */
} Ifx_ERAY_GTUC03;

/** \brief  GTU Configuration Register 4 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_GTUC04_Bits B;                 /**< \brief Bitfield access */
} Ifx_ERAY_GTUC04;

/** \brief  GTU Configuration Register 5 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_GTUC05_Bits B;                 /**< \brief Bitfield access */
} Ifx_ERAY_GTUC05;

/** \brief  GTU Configuration Register 6 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_GTUC06_Bits B;                 /**< \brief Bitfield access */
} Ifx_ERAY_GTUC06;

/** \brief  GTU Configuration Register 7 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_GTUC07_Bits B;                 /**< \brief Bitfield access */
} Ifx_ERAY_GTUC07;

/** \brief  GTU Configuration Register 8 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_GTUC08_Bits B;                 /**< \brief Bitfield access */
} Ifx_ERAY_GTUC08;

/** \brief  GTU Configuration Register 9 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_GTUC09_Bits B;                 /**< \brief Bitfield access */
} Ifx_ERAY_GTUC09;

/** \brief  GTU Configuration Register 10 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_GTUC10_Bits B;                 /**< \brief Bitfield access */
} Ifx_ERAY_GTUC10;

/** \brief  GTU Configuration Register 11 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_GTUC11_Bits B;                 /**< \brief Bitfield access */
} Ifx_ERAY_GTUC11;

/** \brief  Input Buffer Command Mask */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_IBCM_Bits B;                   /**< \brief Bitfield access */
} Ifx_ERAY_IBCM;

/** \brief  Input Buffer Command Request */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_IBCR_Bits B;                   /**< \brief Bitfield access */
} Ifx_ERAY_IBCR;

/** \brief  Module Identification Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_ID_Bits B;                     /**< \brief Bitfield access */
} Ifx_ERAY_ID;

/** \brief  Service Request Line Enable */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_ILE_Bits B;                    /**< \brief Bitfield access */
} Ifx_ERAY_ILE;

/** \brief  Kernel Reset Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_KRST0_Bits B;                  /**< \brief Bitfield access */
} Ifx_ERAY_KRST0;

/** \brief  Kernel Reset Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_KRST1_Bits B;                  /**< \brief Bitfield access */
} Ifx_ERAY_KRST1;

/** \brief  Kernel Reset Status Clear Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_KRSTCLR_Bits B;                /**< \brief Bitfield access */
} Ifx_ERAY_KRSTCLR;

/** \brief  Lock Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_LCK_Bits B;                    /**< \brief Bitfield access */
} Ifx_ERAY_LCK;

/** \brief  Last Dynamic Transmit Slot */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_LDTS_Bits B;                   /**< \brief Bitfield access */
} Ifx_ERAY_LDTS;

/** \brief  Message Buffer Status */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_MBS_Bits B;                    /**< \brief Bitfield access */
} Ifx_ERAY_MBS;

/** \brief  Message Buffer Status Changed 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_MBSC1_Bits B;                  /**< \brief Bitfield access */
} Ifx_ERAY_MBSC1;

